public class Main {
    public static void main(String[] args) {
        /*
        * Сделать:
        * Класс древесина с параметром объем
        * Абстрактный класс Растения с параметром высота
        * Общий метод измерения высоты
        * Классы Дуб, Сосна, Герань
        * Интерфейс для рубки деревьев с получением древесины
        * Для Дуба и Сосны вычислять объём извлекаемой
        * при рубке древесины в зависимости от высоты
        *
        * В текстовом файле записаны строки, названия и высоту растений
        * Загрузить все растения в массив отдельно сделать список подлежащих вырубке
        * Создать лесоруба который сможет рубить только при наличии
        * Вычислить, каков суммарный объем древесины можно получить,
        * если вырубить все дубы и сосны
        * */
    }
}